<?php

$number = random_int(0, 9999);

echo 'Number: '.$number.PHP_EOL;

if (0 === $number) {
    exit('Нема доларів');
}

$firstDigit  = (int) ($number / 1000) % 10;
$secondDigit = (int) ($number / 100) % 10;
$thirdDigit  = (int) ($number / 10) % 10;
$fourthDigit = $number % 10;

const THOUSANDS = [
    1 => 'одна тисяча ',
    2 => 'дві тисячі ',
    3 => 'три тисячі ',
    4 => 'чотири тисячі ',
    5 => 'п\'ять тисяч ',
    6 => 'шість тисяч ',
    7 => 'сім тисяч ',
    8 => 'вісім тисяч ',
    9 => 'дев\'ять тисяч ',
    0 => ''
];

const HUNDREDS = [
    1 => 'сто ',
    2 => 'двісті ',
    3 => 'триста ',
    4 => 'чотириста ',
    5 => 'п\'ятсот ',
    6 => 'шістсот ',
    7 => 'сімсот ',
    8 => 'вісімсот ',
    9 => 'дев\'ятсот ',
    0 => '',
];

$output = THOUSANDS[$firstDigit];
$output .= HUNDREDS[$secondDigit];

if (1 === $thirdDigit) {
    $output .= match ($fourthDigit) {
        0 => 'десять доларів',
        1 => 'одинадцять доларів',
        2 => 'дванадцять доларів',
        3 => 'тринадцять доларів',
        4 => 'чотирнадцять доларів',
        5 => 'п\'ятнадцять доларів',
        6 => 'шістнадцять доларів',
        7 => 'сімнадцять доларів',
        8 => 'вісімнадцять доларів',
        9 => 'дев\'ятнадцять доларів',
    };
} else {
    $output .= match ($thirdDigit) {
        2 => 'двадцять ',
        3 => 'тридцять ',
        4 => 'сорок ',
        5 => 'п\'ятдесят ',
        6 => 'шістдесят ',
        7 => 'сімдесят ',
        8 => 'вісімдесят ',
        9 => 'дев\'яносто ',
        default => ''
    };

    $output .= match ($fourthDigit) {
        1 => 'один долар',
        2 => 'два долари',
        3 => 'три долари',
        4 => 'чотири долари',
        5 => 'п\'ят доларів',
        6 => 'шість доларів',
        7 => 'сім доларів',
        8 => 'вісім доларів',
        9 => 'дев\'ять доларів',
        default => 'доларів',
    };
}

echo $output.PHP_EOL;
