<?php

// Змінна існує з того момент, як Ви дали їй ім'я та початкове значення.
$number = 10;

// Використовуючи задане ім'я змінної Ви можете звертатися до її значення по
// цьому імені. Пам'ятайте, що імена змінних чутливі до регістру символів.
echo $number;

// Константа PHP_EOL містить символ перенесення рядка. він потрібен, щоб
// вивести текст у терміналі на різних рядках.
echo PHP_EOL;

// Змінна на те і змінна, що ії значення можна змінити у довільний момент часу.
$number = 50;

// Тут будет нове значення змінної.
echo $number;
